#include <iostream>
using namespace std;
int main()
{
    int a, b, c, d, e;
    const char* arr[9] {"ь первое","ь второе","ь третье","ь четвертое","ь пятое","ь шестое","ь седьмое", "ь восьмое", "ь девятое"};
    const char* arr1[12] {"января","февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
    const char* arr2[9] {"один", "две", "три", "четыр", "пят", "шест", "сем", "восем", "девят"};
    cout<<"Введите число от 1 до 31: ";
    cin>>a;
    cout<<"Введите число от 1 до 12: ";
    cin>>b;
    c=a/10;
    if (c==1) {
        d=a%10;
        cout<<arr2[d-1];
        cout<<"надцатое ";
    }
    if (c>1) {
        if (c==2)
        cout<<"двадцат";
        else if (c==3)
        cout<<"тридцат";
        d=a%10;
        if (d==0) cout<<"ое ";
        else cout<<arr[d-1]<<" ";
    }
        cout<<arr1[b-1];
    return 0;
}
