#include <iostream>
using namespace std;
int main()
{
    int a, b, c, d;
    const char* arr[9] {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    const char* arr1[8] {"двадцать", "тридацать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    const char* arr2[9] {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    const char* arr3[9] {"один", "две", "три", "четыр", "пят", "шест", "сем", "восем", "девят"};
    cout<<"Введите число от 100 до 999: ";
    cin>>a;
    b=a/10%10;
    c=a%10;
    a=a/100;
    cout<<arr[a-1]<<" ";
    if (b==1) {
        cout<<arr3[c-1];
        cout<<"надцать";
    }
    else if (b > 1 && b < 10) {
    cout<<arr1[b-2]<<" ";
    cout<<arr2[c-1];
    }
    return 0;
}
